#设置SQL语句所有编码为UTF8
SET NAMES UTF8;
#丢弃数据库anime,如果存在的话
DROP DATABASE IF EXISTS anime;
#创建数据库anime,保存的字符集为UTF8
CREATE DATABASE anime CHARSET=UTF8;
USE anime;
#创建用户信息表
CREATE TABLE lsj_user(
	uid INT PRIMARY KEY AUTO_INCREMENT,
	uname VARCHAR(38),
	upwd VARCHAR(38),
	email VARCHAR(64),
	phone VARCHAR(16),
	avatar VARCHAR(256),
	user_name VARCHAR(32),
	gender INT
);
INSERT INTO lsj_user VALUES
(1,'SaberTino','67974ed5541b','10203435@qq.com','13669397025',null,'剑沙城海',1 ),
(2,'Saber','233','102034355@qq.com','13669397027',null,'林崇会',1 ),
(3,'lili','666','102034355@qq.com','13669397027',null,'雨曦梦影',0 );

#创建图片路径表
CREATE TABLE lsj_img1(
	uid INT PRIMARY KEY AUTO_INCREMENT,
	uimage VARCHAR(128)
);
#按网页所在的路径设置
INSERT INTO lsj_img1 VALUES
(1,'images/movie1.jpg'),
(2,'images/movie2.jpg'),
(3,'images/movie3.jpg'),
(4,'images/movie4.jpg'),
(5,'images/anime1.jpg'),
(6,'images/anime2.jpg'),
(7,'images/anime3.jpg'),
(8,'images/anime4.jpg'),
(9,'images/TV1.jpg'),
(10,'images/TV2.jpg'),
(11,'images/TV3.jpg'),
(12,'images/TV4.jpg');

#动漫详情页分页
CREATE TABLE lsj_list(
	lid INT	PRIMARY KEY AUTO_INCREMENT,
	title CHAR(18),
	area CHAR(6),
	year CHAR(6),
	sing CHAR(25),
	play INT,
	look CHAR(25),
	introduce CHAR(150),
	src CHAR(150)
);
INSERT INTO lsj_list VALUES
(NULL,"海贼王","日本","1997年","奇幻|热血|励志|童年|冒险|搞笑",823064,"OP在哪呢","拥有整个世界财富，名声，势力的海贼王哥尔·罗杰把所有财宝都放在“伟大的航路”里，于是所有的男子汉都航向那里追逐梦想，世界开始迎接大海贼时代的来临。","../images/fj-1.jpg"),
(NULL,"火影忍者","日本","1999年","奇幻|热血|励志|童年|冒险|搞笑",523064,"热血的火影","这是一个忍者的世界。从小身上封印着邪恶的九尾妖狐，鸣人受尽了村人的冷落，只是拼命用各种恶作剧试图吸引大家的注意力。为了让更多的人认可自己，鸣人的目标是成为第六代火影！","../images/fj-2.jpg"),
(NULL,"美食的俘虏","日本","2011年","奇幻|热血|励志|童年|冒险|搞笑",223064,"jump热血美食番，各种燃","高级料理餐厅的主厨小松，为了寻找高级，新鲜的料理而认识了美食猎人阿虏，在阿虏的带领下，小松进入了一个他前所未见的美食的世界。","../images/fj-3.jpg"),
(NULL,"七龙珠TV","日本","1989年","奇幻|热血|励志|童年|冒险|搞笑",833064,"童年回忆","长有尾巴的孙悟空天生神力，加上曾得到己过世的爷爷(孙悟饭)训练武术，所以悟空找寻七龙珠的期间多次打败作恶的坏人，并且认识了乌龙、乐平、龟仙人、牛魔王及其女儿琪琪等朋友。","../images/fj-4.jpg"),
(NULL,"圣斗士星矢 黄金魂","日本","2015年","奇幻|热血|励志|童年|冒险|搞笑",133064,"这是黄金圣斗士们满血复活、集体升级神圣衣的节奏！","这部新作将是艾欧里亚身穿的是狮子座神圣衣，相信应该会有不少未披露的隐秘。现在官方已经公布了正式版的PV，在视频里可以看到身穿狮子座黄金神圣衣的艾欧里亚。","../images/fj-5.jpg"),
(NULL,"网球王子国语版","日本","2001年","奇幻|热血|励志|运动|搞笑",103064,"杀人网球","新学期开始，青春学园男子网球部的迎来了一个初一新生——越前龙马。出人意料的是他的实力也确实在高的惊人，美国少年网球比赛四连冠的成绩，引起了网球部指导兼社长手冢的注意，并破例将他选入正式队员队伍","../images/fj-6.jpg"),
(NULL,"进击的巨人","日本","2015年","奇幻|热血|励志|冒险",203064,"什么是自由","故事发生的背景是在一个存在吞噬人类的巨人世界中，经过被巨人捕食的残酷历史，幸存下来的人类建造了巨大的城墙防止巨人的入侵，并终年生活在圈起来的小天地中，为了安全而失去了到墙壁外面世界的自由。","../images/fj-7.jpg"),
(NULL,"七龙珠改","日本","2009年","奇幻|热血|励志|冒险",803064,"纪念龙珠Z开播20年","使用最新的数码修补技术进行处理，让Z传说以更加色彩鲜艳的姿态在TV动画上复活。OP与ED曲焕然一新，背景音乐和人物配音也重新录制。剧情方面也更加紧凑，更加贴近漫画。","../images/fj-8.jpg"),
(NULL,"银魂","日本","2006年","奇幻|热血|励志|冒险",703064,"以风格独特的毒舌、吐槽、无厘头、异想天开的恶搞","银魂本作是以科幻时代剧为题材的搞笑漫画。以风格独特的毒舌、吐槽、无厘头、异想天开的恶搞，为作品的特色与卖点，但也不时穿插感人的故事，以及人生道理的描写。","../images/fj-9.jpg"),
(NULL,"龙珠超","日本","2015年","奇幻|热血|励志|冒险",943064,"魔人布欧之后的故事","与自漫长沉睡中觉醒的破坏神比鲁斯的相遇，加上曾经被人敬畏为“宇宙帝王”的弗利萨的复活，在这些接连迫近悟空等人的威胁之上，地球周边还发生了星球消失的不可思议现象。地球到底发生了什么事","../images/fj-10.jpg"),
(NULL,"一拳超人","日本","2015年","奇幻|热血|励志|冒险",643064,"虽然只是兴趣使然，但是只要一击就干掉敌人！","故事讲述了在就职过程中寻不到出路的主人公琦玉对于成为英雄的志向后，琦玉通过努力锻炼终于获得了最强的力量，但因此导致脱发变成了光头。之后他与弟子杰诺斯一起加入了英雄协会，开始了与众多","../images/fj-11.jpg"),
(NULL,"全职猎人","日本","2011年","奇幻|热血|励志|冒险",543064,"赌上性命的冒险开始了！","住在鲸鱼岛的少年-小杰​​，他的梦想就是要像父亲一样成为一名「猎人」。向分散在这个世界各角落的财宝、秘宝、珍品、珍兽","../images/fj-12.jpg"),
(NULL,"滑头鬼之孙","日本","2011年","奇幻|热血|励志|冒险",443064,"话说滑头鬼的头也是和头发一样长","自幼和妖怪们住在一起的少年'陆雄'非常喜欢妖怪，而且也希望能继承自己的祖父“妖怪首领滑瓢”，成为一个优秀的妖怪首领","../images/fj-13.jpg"),
(NULL,"钢之炼金术师","日本","2011年","奇幻|热血|励志|冒险",343064,"寻找贤者之石的旅程","以爱德华和艾尔冯斯兄弟之间的羁绊为中心展开，故事中还将涉及各种各样的炼金术，军事帝国扩展谋略，以及对剧中众多登场人物感情的细腻描述。","../images/fj-14.jpg"),
(NULL,"犬夜叉","日本","2000年","奇幻|热血|励志|冒险",673064,"半妖与人类的相恋，四魂之玉的争夺，经典之作！","为得到四魂之玉以成为真正的妖怪，实际上并非完全如此。来到战国时代的戈薇被误认为是已逝世的巫女桔梗，而后因其","../images/fj-15.jpg"),
(NULL,"妖精的尾巴","日本","2016年","奇幻|热血|励志|冒险",873064,"这次是萌萌哒的妖尾","公会的初代会长梅比斯在×686年，和来到天狼岛的寻宝猎人们的相遇为契机，梅比斯的人生向着从未想过的方向发展……","../images/fj-16.jpg"),
(NULL,"死神","日本","2004年","奇幻|热血|励志|冒险",883064,"尸魂界上演大乱斗","死神是由日本漫画家《久保带人》创作的漫画作品,其漫画死神于2001/08在《少年JUMP》开始连载,随即大红大紫,2004/10由东京电视台买下版权,然后播放电视动画","../images/fj-17.jpg"),
(NULL,"某科学的超电磁炮","日本","2009年","百合|奇幻|冒险|热血",983064,"充满异能者和魔法师的学园都市","所有学生都接受超能力开发，并大都借由药物、催眠术与通电刺激等方式取得超能力。有各种类型不同能力，以范围和威力分为无能力者、低能力者、异能力者、强能力者、大能力者和超能","../images/fj-18.jpg"),
(NULL,"Fate/Stay night","日本","2006年","游戏|奇幻|动作|恋爱|热血",993064,"根据虚渊玄著作的同名小说改编的电视动画","圣杯--传说中可实现持有者一切愿望的宝物。7名由圣杯选出的御主，与7名被称为从者的使魔订定契约。能获得圣杯的只有一组，这7组人马为了成为最后的那一组而互相残杀，战斗席卷而来…","../images/fj-19.jpg"),
(NULL,"EVA","日本","2006年","童年|机战|冒险|热血",793064,"日本历史中最伟大的动画之一","公元2015年又出现了新的入侵者，一种似人的巨大机械战斗群，人们将之称为'使徒'，大概是影射他们是上帝派来的使者，要来消灭作恶多端的","../images/fj-20.jpg");